src/Documents/ИсходящийКаталогТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>ИсходящийКаталогТоваров</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийЗапросКаталога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОжиданияОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектронногоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектронногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихКодНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ИсходящийКаталогТоваров/Ext/ObjectModule.bsl
Функция ПолучитьНаименованиеСтрокиТовара(СтрокаТаблицыТовары)
	
	Если ЗначениеЗаполнено(СтрокаТаблицыТовары.Номенклатура.НаименованиеПолное) Тогда
		НаименованиеТовара = СтрокаТаблицыТовары.Номенклатура.НаименованиеПолное;
	Иначе
		НаименованиеТовара = СтрокаТаблицыТовары.Номенклатура.Наименование;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаТаблицыТовары.ХарактеристикаНоменклатуры) Тогда
		НаименованиеТовара = НаименованиеТовара + " (" + Строка(СтрокаТаблицыТовары.ХарактеристикаНоменклатуры)	+ ")";
	КонецЕсли;
	
	Возврат НаименованиеТовара;	
	
КонецФункции

Процедура ДобавитьСтрокиКаталогаТоваровВДеревоТэгов(СтрокиДерева, Отказ, Сообщение);
	
 	Для каждого СтрокаТаблицыТовары Из Товары Цикл
		
		СообщениеСтроки = "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваНоменклатурыЭлектронногоОбмена.Код КАК ИмяСвойства,
		|	ЗначенияСвойствОбъектов.Значение КАК ЗначениеСвойства
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СвойстваНоменклатурыЭлектронногоОбмена КАК СвойстваНоменклатурыЭлектронногоОбмена
		|		ПО СвойстваНоменклатурыЭлектронногоОбмена.СвойствоНоменклатуры = ЗначенияСвойствОбъектов.Свойство
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Номенклатура";
		
		СвойстваТовара = Новый Структура;
		
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТаблицыТовары.Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СвойстваТовара.Вставить(СокрЛП(Выборка.ИмяСвойства), Выборка.ЗначениеСвойства);
		КонецЦикла;
		
		СтрокиТовара = ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиДерева, "Товар").Строки;
		
		Значение = ЭлектронныеДокументы.СоздатьИдентификаторыЭлОбмена(?(НЕ ЗначениеЗаполнено(СтрокаТаблицыТовары.ХарактеристикаНоменклатуры), СтрокаТаблицыТовары.Номенклатура, СтрокаТаблицыТовары.ХарактеристикаНоменклатуры));
		ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ИдТовараПоставщика", Значение , "ТоварИД");
		
		МенеджерЗаписи = РегистрыСведений.НоменклатураКонтрагентов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Контрагент                 = Контрагент;
		МенеджерЗаписи.Номенклатура               = СтрокаТаблицыТовары.Номенклатура;
		МенеджерЗаписи.ХарактеристикаНоменклатуры = СтрокаТаблицыТовары.ХарактеристикаНоменклатуры;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ИдТовараКлиента", МенеджерЗаписи.КодНоменклатурыКонтрагента, "ТоварИД")
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
		
		Запрос.УстановитьПараметр("Владелец", СтрокаТаблицыТовары.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", СтрокаТаблицыТовары.ХарактеристикаНоменклатуры);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ШтриховойКод", "0" + Выборка.Штрихкод, "GTIN")
		КонецЦикла;
		
		ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ОКЕИ", СтрокаТаблицыТовары.Номенклатура.БазоваяЕдиницаИзмерения.Код, "ОКЕИ");
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ОКП", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ОКП", ЗначениеСвойства, "ОКП")
		Иначе
			СообщениеСтроки = СообщениеСтроки + Символы.ПС + " - не заполнено ОКП";
		КонецЕсли;
		
		СтранаПроисхождения = СтрокаТаблицыТовары.Номенклатура.СтранаПроисхождения;
		Если НЕ ЗначениеЗаполнено(СтранаПроисхождения) Тогда
			СтранаПроисхождения = Справочники.КлассификаторСтранМира.Россия;	
		КонецЕсли;
		ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ИСО3166", СтранаПроисхождения.Код, "ИСО3166");
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ОКВЭД", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ОКВЭД", ЗначениеСвойства, "ОКВЭД")
		КонецЕсли;
		
		ЗначениеСвойства = ПолучитьНаименованиеСтрокиТовара(СтрокаТаблицыТовары);
 		Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "Наименование", ЗначениеСвойства);
		Иначе
			СообщениеСтроки = СообщениеСтроки + Символы.ПС + " - не заполнено наименование";
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ТорговаяМарка", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ТорговаяМарка", ЗначениеСвойства)
		Иначе
			СообщениеСтроки = СообщениеСтроки + Символы.ПС + " - не заполнена торговая марка";
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("Производитель", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "Производитель", ЗначениеСвойства)
		Иначе
			СообщениеСтроки = СообщениеСтроки + Символы.ПС + " - не заполнен производитель";
		КонецЕсли;
		
		ЗначениеСвойства = СтрокаТаблицыТовары.Номенклатура.ДополнительноеОписаниеНоменклатуры;
		Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "Описание", ЗначениеСвойства)
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ВесНетто", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ВесНетто", ЗначениеСвойства, "ВесТип")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ВесБрутто", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ВесБрутто", ЗначениеСвойства, "ВесТип")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ВысотаСлояТовара", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ВысотаСлояТовара", ЗначениеСвойства, "Габариты")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ВысотаТовара", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ВысотаТовара", ЗначениеСвойства, "Габариты")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ШиринаТовара", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ШиринаТовара", ЗначениеСвойства, "Габариты")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ГлубинаТовара", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ГлубинаТовара", ЗначениеСвойства, "Габариты")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ОбъемТовара", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ОбъемТовара", ЗначениеСвойства, "ОбъемТип")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("МинКоличествоДляЗаказа", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "МинКоличествоДляЗаказа", ЗначениеСвойства, "КоличествоТип")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("КоличествоВСлоеНаЕвропалете", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "КоличествоВСлоеНаЕвропалете", ЗначениеСвойства, "КоличествоТип")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("СрокХранения", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "СрокХранения", ЭлектронныеДокументы.ХМЛДлительность(ЗначениеСвойства));
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("ТемператураХранения", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "ТемператураХранения", ЗначениеСвойства)
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("Кратность", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "Кратность", ЗначениеСвойства, "КратностьТип")
		КонецЕсли;
		
		ЗначениеСвойства = Неопределено;
		Если СвойстваТовара.Свойство("КоличествоЕдиницОбъектаВерхнегоУровня", ЗначениеСвойства) и ЗначениеЗаполнено(ЗначениеСвойства) Тогда
			ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиТовара, "КоличествоЕдиницОбъектаВерхнегоУровня", ЗначениеСвойства, "КоличествоТип")
		КонецЕсли;
		
		Если Не ПустаяСтрока(СообщениеСтроки) Тогда
			Сообщение = Сообщение + Символы.ПС + "Строка: " + СтрокаТаблицыТовары.НомерСтроки + ". Номенклатура: """ + СтрокаТаблицыТовары.Номенклатура + """ не может быть выгружена:" + СообщениеСтроки;
			Отказ = Истина;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

#Если Клиент Тогда
	
Процедура ВыполнитьПроверкуОбязательностиСопоставленияСвойствНоменклатуры(Отказ, Сообщение)
	
	МассивСвойствДляОбменаНоменклатурой = ЭлектронныеДокументы.ПолучитьМассивОбязательныхСвойствДляОбменаТоварами();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СвойстваНоменклатурыЭлектронногоОбмена.СвойствоНоменклатуры
	               |ИЗ
	               |	Справочник.СвойстваНоменклатурыЭлектронногоОбмена КАК СвойстваНоменклатурыЭлектронногоОбмена
				   |ГДЕ
				   |	СвойстваНоменклатурыЭлектронногоОбмена.Ссылка В (&МассивСвойств)
				   |	И СвойстваНоменклатурыЭлектронногоОбмена.СвойствоНоменклатуры = &ПустоеСвойство";
				   
	Запрос.УстановитьПараметр("МассивСвойств", МассивСвойствДляОбменаНоменклатурой);
	Запрос.УстановитьПараметр("ПустоеСвойство", ПланыВидовХарактеристик.СвойстваОбъектов.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	ОтветПользователя = Вопрос("Не все свойства для выгрузки номенклатуры установлены. 
	|Определить соответствие свойств?", РежимДиалогаВопрос.ДаНет, ,  КодВозвратаДиалога.Да);
	
	Если ОтветПользователя <> КодВозвратаДиалога.Да	Тогда
		Возврат;
	КонецЕсли;
	
	ФормаСпискаСвойств = Справочники.СвойстваНоменклатурыЭлектронногоОбмена.ПолучитьФормуСписка();
	ФормаСпискаСвойств.Открыть();	
	
КонецПроцедуры

#КонецЕсли

Процедура ЗаполнитьXML(ОбъектXML, Отказ, Сообщение, ДобавлятьАтрибутПроверки = Ложь, ДополнятьИсходящееСообщениеПриложеннымиФайлами = Ложь) Экспорт
	
	#Если Клиент Тогда
		
		ВыполнитьПроверкуОбязательностиСопоставленияСвойствНоменклатуры(Отказ, Сообщение);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	#КонецЕсли
	
	ПрефиксИмен = "";
	ПространствоИменСОДИ    = "urn:moo-sodi.ru:commerceml_sodi";
	
	ОбъектXML.ЗаписатьНачалоЭлемента("КаталогТоваров", ПространствоИменСОДИ);
	ОбъектXML.ЗаписатьСоответствиеПространстваИмен(ПрефиксИмен, ПространствоИменСОДИ);
	ОбъектXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	
	Если ДобавлятьАтрибутПроверки Тогда
		ОбъектXML.ЗаписатьАтрибут("xsi:schemaLocation","urn:moo-sodi.ru:commerceml_sodi cml-catalogs-3.0sodi.xsd");
	КонецЕсли;
	
	ДеревоТэгов  = ЭлектронныеДокументы.ИнициализироватьДеревоТэгов(ЭтотОбъект, Отказ, Сообщение);
	СтрокиДерева = ДеревоТэгов.Строки;
		
	ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиДерева, "НомерИсходногоДокумента", ИсходныйДокумент.НомерВходящегоДокумента, "ДокументИД");
	ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиДерева, "ДлительностьОжиданияОтвета", ЭлектронныеДокументы.ХМЛДлительность(ДлительностьОжиданияОтвета));
	ЭлектронныеДокументы.ДобавитьСтрокуВДеревоТэгов(СтрокиДерева, "ЭтоПолныйКаталог", ЭлектронныеДокументы.ХМЛБулево(ЭтоПолныйКаталог));
	ДобавитьСтрокиКаталогаТоваровВДеревоТэгов(СтрокиДерева, Отказ, Сообщение);
	ЭлектронныеДокументы.ЗаписатьТэгиВXMLДокумент(ОбъектXML, ДеревоТэгов.Строки, ПрефиксИмен);
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭлектронныеДокументы.ПередЗаписьюДокументаВведенногоНаОсновании(ЭтотОбъект, Отказ);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ВходящийЗапросКаталога") Тогда
		
		ЭлектронныеДокументы.ЗаполнитьШапкуИсходящегоДокументаПоОснованию(ЭтотОбъект, Основание);
		
	КонецЕсли;
	
КонецПроцедуры

Функция SOAPAction() Экспорт
	
	Возврат "catalog";
	
КонецФункции // ()
